espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_struct.h
/**
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */

#pragma once

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/** Group: program_data registers */
/** Type of pgm_datan register
 *  Represents pgm_datan
 */
typedef union {
    struct {
        /** pgm_data_n : R/W; bitpos: [31:0]; default: 0;
         *  Configures the nth 32-bit data to be programmed.
         */
        uint32_t pgm_data_n:32;
    };
    uint32_t val;
} efuse_pgm_datan_reg_t;

/** Type of pgm_check_valuen register
 *  Represents pgm_check_valuen
 */
typedef union {
    struct {
        /** pgm_rs_data_n : R/W; bitpos: [31:0]; default: 0;
         *  Configures the nth RS code to be programmed.
         */
        uint32_t pgm_rs_data_n:32;
    };
    uint32_t val;
} efuse_pgm_check_valuen_reg_t;


/** Group: block0 registers */
/** Type of rd_wr_dis register
 *  Represents rd_wr_dis
 */
typedef union {
    struct {
        /** wr_dis_rd_dis : RO; bitpos: [0]; default: 0;
         *  Write disable bit 0 for EFUSE_RD_DIS
         */
        uint32_t wr_dis_rd_dis:1;
        /** wr_dis_1 : RO; bitpos: [1]; default: 0;
         *  Write disable bit 1 for EFUSE_KM_RND_SWITCH_CYCLE, EFUSE_KM_DISABLE_DEPLOY_MODE,
         *  EFUSE_KM_DEPLOY_ONLY_ONCE, EFUSE_FORCE_USE_KEY_MANAGER_KEY,
         *  EFUSE_FORCE_DISABLE_SW_INIT_KEY, EFUSE_KM_XTS_KEY_LENGTH_256, EFUSE_LOCK_KM_KEY
         */
        uint32_t wr_dis_1:1;
        /** wr_dis_2 : RO; bitpos: [2]; default: 0;
         *  Write disable bit 2 for EFUSE_DIS_USB_JTAG, EFUSE_DIS_USB_SERIAL_JTAG,
         *  EFUSE_DIS_FORCE_DOWNLOAD, EFUSE_SPI_DOWNLOAD_MSPI_DIS, EFUSE_DIS_TWAI,
         *  EFUSE_JTAG_SEL_ENABLE, EFUSE_DIS_PAD_JTAG, EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT,
         *  EFUSE_DIS_WIFI6, EFUSE_WDT_DELAY_SEL, EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE,
         *  EFUSE_DIS_WDT, EFUSE_DIS_SWD, EFUSE_PMU_FLASH_POWER_SEL,
         *  EFUSE_PMU_FLASH_POWER_SEL_EN, EFUSE_POWER_GLITCH_EN
         */
        uint32_t wr_dis_2:1;
        /** wr_dis_3 : RO; bitpos: [3]; default: 0;
         *  Write disable bit 3 for EFUSE_PVT_0_GLITCH_EN, EFUSE_PVT_0_GLITCH_MODE,
         *  EFUSE_PVT_1_GLITCH_EN, EFUSE_PVT_1_GLITCH_MODE
         */
        uint32_t wr_dis_3:1;
        /** wr_dis_spi_boot_crypt_cnt : RO; bitpos: [4]; default: 0;
         *  Write disable bit 4 for EFUSE_SPI_BOOT_CRYPT_CNT
         */
        uint32_t wr_dis_spi_boot_crypt_cnt:1;
        /** wr_dis_secure_boot_key_revoke0 : RO; bitpos: [5]; default: 0;
         *  Write disable bit 5 for EFUSE_SECURE_BOOT_KEY_REVOKE0
         */
        uint32_t wr_dis_secure_boot_key_revoke0:1;
        /** wr_dis_secure_boot_key_revoke1 : RO; bitpos: [6]; default: 0;
         *  Write disable bit 6 for EFUSE_SECURE_BOOT_KEY_REVOKE1
         */
        uint32_t wr_dis_secure_boot_key_revoke1:1;
        /** wr_dis_secure_boot_key_revoke2 : RO; bitpos: [7]; default: 0;
         *  Write disable bit 7 for EFUSE_SECURE_BOOT_KEY_REVOKE2
         */
        uint32_t wr_dis_secure_boot_key_revoke2:1;
        /** wr_dis_key_purpose_0 : RO; bitpos: [8]; default: 0;
         *  Write disable bit 8 for EFUSE_KEY_PURPOSE_0
         */
        uint32_t wr_dis_key_purpose_0:1;
        /** wr_dis_key_purpose_1 : RO; bitpos: [9]; default: 0;
         *  Write disable bit 9 for EFUSE_KEY_PURPOSE_1
         */
        uint32_t wr_dis_key_purpose_1:1;
        /** wr_dis_key_purpose_2 : RO; bitpos: [10]; default: 0;
         *  Write disable bit 10 for EFUSE_KEY_PURPOSE_2
         */
        uint32_t wr_dis_key_purpose_2:1;
        /** wr_dis_key_purpose_3 : RO; bitpos: [11]; default: 0;
         *  Write disable bit 11 for EFUSE_KEY_PURPOSE_3
         */
        uint32_t wr_dis_key_purpose_3:1;
        /** wr_dis_key_purpose_4 : RO; bitpos: [12]; default: 0;
         *  Write disable bit 12 for EFUSE_KEY_PURPOSE_4
         */
        uint32_t wr_dis_key_purpose_4:1;
        /** wr_dis_13 : RO; bitpos: [13]; default: 0;
         *  reserved
         */
        uint32_t wr_dis_13:1;
        /** wr_dis_14 : RO; bitpos: [14]; default: 0;
         *  Write disable bit 14 for EFUSE_DIS_SM_CRYPT, EFUSE_ECC_FORCE_CONST_TIME,
         *  EFUSE_ECDSA_DISABLE_SOFT_K, EFUSE_SEC_DPA_LEVEL, EFUSE_XTS_DPA_CLK_ENABLE,
         *  EFUSE_XTS_DPA_PSEUDO_LEVEL, EFUSE_SDC_NONCE_ENA, EFUSE_SDC_CHIP_INFO_SOURCE,
         *  EFUSE_SDC_DISABLE_FAST_VEF, EFUSE_ENA_XTS_SHADOW,
         *  EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER, EFUSE_RE_ENABLE_JTAG_SOURCE
         */
        uint32_t wr_dis_14:1;
        /** wr_dis_secure_boot_en : RO; bitpos: [15]; default: 0;
         *  Write disable bit 15 for EFUSE_SECURE_BOOT_EN
         */
        uint32_t wr_dis_secure_boot_en:1;
        /** wr_dis_secure_boot_aggressive_revoke : RO; bitpos: [16]; default: 0;
         *  Write disable bit 16 for EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE
         */
        uint32_t wr_dis_secure_boot_aggressive_revoke:1;
        /** wr_dis_17 : RO; bitpos: [17]; default: 0;
         *  reserved
         */
        uint32_t wr_dis_17:1;
        /** wr_dis_18 : RO; bitpos: [18]; default: 0;
         *  Write disable bit 18 for EFUSE_FLASH_TYPE, EFUSE_DIS_USB_OTG_DOWNLOAD_MODE,
         *  EFUSE_FLASH_TPUW, EFUSE_DIS_DOWNLOAD_MODE, EFUSE_DIS_DIRECT_BOOT,
         *  EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT, EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE,
         *  EFUSE_ENABLE_SECURITY_DOWNLOAD, EFUSE_UART_PRINT_CONTROL, EFUSE_FORCE_SEND_RESUME,
         *  EFUSE_SECURE_VERSION
         */
        uint32_t wr_dis_18:1;
        /** wr_dis_huk_gen_state : RO; bitpos: [19]; default: 0;
         *  Write disable bit 19 for EFUSE_HUK_GEN_STATE
         */
        uint32_t wr_dis_huk_gen_state:1;
        /** wr_dis_block1 : RO; bitpos: [20]; default: 0;
         *  Write disable bit 20 for BLOCK1
         */
        uint32_t wr_dis_block1:1;
        /** wr_dis_block2 : RO; bitpos: [21]; default: 0;
         *  Write disable bit 21 for BLOCK2
         */
        uint32_t wr_dis_block2:1;
        /** wr_dis_block3 : RO; bitpos: [22]; default: 0;
         *  Write disable bit 22 for BLOCK3
         */
        uint32_t wr_dis_block3:1;
        /** wr_dis_block4 : RO; bitpos: [23]; default: 0;
         *  Write disable bit 23 for BLOCK4
         */
        uint32_t wr_dis_block4:1;
        /** wr_dis_block5 : RO; bitpos: [24]; default: 0;
         *  Write disable bit 24 for BLOCK5
         */
        uint32_t wr_dis_block5:1;
        /** wr_dis_block6 : RO; bitpos: [25]; default: 0;
         *  Write disable bit 25 for BLOCK6
         */
        uint32_t wr_dis_block6:1;
        /** wr_dis_block7 : RO; bitpos: [26]; default: 0;
         *  Write disable bit 26 for BLOCK7
         */
        uint32_t wr_dis_block7:1;
        /** wr_dis_block8 : RO; bitpos: [27]; default: 0;
         *  Write disable bit 27 for BLOCK8
         */
        uint32_t wr_dis_block8:1;
        /** wr_dis_block9 : RO; bitpos: [28]; default: 0;
         *  Write disable bit 28 for BLOCK9
         */
        uint32_t wr_dis_block9:1;
        /** wr_dis_29 : RO; bitpos: [29]; default: 0;
         *  reserved
         */
        uint32_t wr_dis_29:1;
        /** wr_dis_30 : RO; bitpos: [30]; default: 0;
         *  reserved
         */
        uint32_t wr_dis_30:1;
        /** wr_dis_soft_dis_jtag : RO; bitpos: [31]; default: 0;
         *  Write disable bit 31 for EFUSE_SOFT_DIS_JTAG
         */
        uint32_t wr_dis_soft_dis_jtag:1;
    };
    uint32_t val;
} efuse_rd_wr_dis_reg_t;

/** Type of rd_repeat_data0 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** rd_dis_block4 : RO; bitpos: [0]; default: 0;
         *  Read disable bit 0 for BLOCK4
         */
        uint32_t rd_dis_block4:1;
        /** rd_dis_block5 : RO; bitpos: [1]; default: 0;
         *  Read disable bit 1 for BLOCK5
         */
        uint32_t rd_dis_block5:1;
        /** rd_dis_block6 : RO; bitpos: [2]; default: 0;
         *  Read disable bit 2 for BLOCK6
         */
        uint32_t rd_dis_block6:1;
        /** rd_dis_block7 : RO; bitpos: [3]; default: 0;
         *  Read disable bit 3 for BLOCK7
         */
        uint32_t rd_dis_block7:1;
        /** rd_dis_block8 : RO; bitpos: [4]; default: 0;
         *  Read disable bit 4 for BLOCK8
         */
        uint32_t rd_dis_block8:1;
        /** rd_dis_block9 : RO; bitpos: [5]; default: 0;
         *  Read disable bit 5 for BLOCK9
         */
        uint32_t rd_dis_block9:1;
        /** rd_dis_6 : RO; bitpos: [6]; default: 0;
         *  reserved
         */
        uint32_t rd_dis_6:1;
        /** reserved_0_39 : R; bitpos: [9:7]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_39:3;
        /** dis_usb_jtag : RO; bitpos: [10]; default: 0;
         *  Represents whether the function of usb switch to jtag is disabled or enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_usb_jtag:1;
        /** dis_usb_serial_jtag : RO; bitpos: [11]; default: 0;
         *  Represents whether USB-Serial-JTAG is disabled or enabled.
         *  1: disabled
         *  0: enabled
         *
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t dis_usb_serial_jtag:1;
        /** dis_force_download : RO; bitpos: [12]; default: 0;
         *  Represents whether the function that forces chip into download mode is disabled or
         *  enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_force_download:1;
        /** spi_download_mspi_dis : RO; bitpos: [13]; default: 0;
         *  Represents whether SPI0 controller during boot_mode_download is disabled or enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t spi_download_mspi_dis:1;
        /** dis_twai : RO; bitpos: [14]; default: 0;
         *  Represents whether TWAI function is disabled or enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_twai:1;
        /** jtag_sel_enable : RO; bitpos: [15]; default: 0;
         *  Represents whether the selection between usb_to_jtag and pad_to_jtag through
         *  strapping gpio15 when both EFUSE_DIS_PAD_JTAG and EFUSE_DIS_USB_JTAG are equal to 0
         *  is enabled or disabled.
         *  1: enabled
         *  0: disabled
         */
        uint32_t jtag_sel_enable:1;
        /** soft_dis_jtag : RO; bitpos: [18:16]; default: 0;
         *  Represents whether JTAG is disabled in soft way.
         *  Odd number: disabled
         *  Even number: enabled
         */
        uint32_t soft_dis_jtag:3;
        /** dis_pad_jtag : RO; bitpos: [19]; default: 0;
         *  Represents whether JTAG is disabled in the hard way(permanently).
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_pad_jtag:1;
        /** dis_download_manual_encrypt : RO; bitpos: [20]; default: 0;
         *  Represents whether flash encrypt function is disabled or enabled(except in SPI boot
         *  mode).
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_download_manual_encrypt:1;
        /** reserved_0_53 : R; bitpos: [21]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_53:1;
        /** dis_wifi6 : RO; bitpos: [22]; default: 0;
         *  Represents whether the WIFI6 feature is enabled or disabled. 1: WIFI6 is disabled;
         *  0: WIFI6 is enabled
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t dis_wifi6:1;
        /** huk_gen_state : RO; bitpos: [27:23]; default: 0;
         *  Represents the control of validation of HUK generate mode. Odd of 1 is invalid,
         *  even of 1 is valid.
         */
        uint32_t huk_gen_state:5;
        /** reserved_0_60 : R; bitpos: [31:28]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_60:4;
    };
    uint32_t val;
} efuse_rd_repeat_data0_reg_t;

/** Type of rd_repeat_data1 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** km_rnd_switch_cycle : RO; bitpos: [0]; default: 0;
         *  Represents the control of key manager random number switch cycle. 0: control by
         *  register. 1: 8 km clk cycles. 2: 16 km cycles. 3: 32 km cycles
         */
        uint32_t km_rnd_switch_cycle:1;
        /** reserved_0_65 : R; bitpos: [1]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_65:1;
        /** km_disable_deploy_mode : RO; bitpos: [6:2]; default: 0;
         *  Represents whether the deploy mode of key manager is disable or not.
         *  1: disabled
         *  0: enabled.
         *  bit 0: ecsda, bit 1: flash & spi boot srambler, bit2: hmac & aes, bit3: ds & SDC
         *  nonce, bit4: psram
         */
        uint32_t km_disable_deploy_mode:5;
        /** km_deploy_only_once : RO; bitpos: [11:7]; default: 0;
         *  Represents whether corresponding key can only be deployed once. 1 is true, 0 is
         *  false.
         *  0: ecsda
         *  1: flash & spi boot srambler
         *  2: hmac & aes
         *  3: ds & SDC nonce
         *  4: psram
         */
        uint32_t km_deploy_only_once:5;
        /** force_use_key_manager_key : RO; bitpos: [16:12]; default: 0;
         *  Represents whether corresponding key must come from key manager. 1 is true, 0 is
         *  false.
         *  0: ecsda
         *  1: flash
         *  2: reserved
         *  3: reserved
         *  4: psram
         */
        uint32_t force_use_key_manager_key:5;
        /** force_disable_sw_init_key : RO; bitpos: [17]; default: 0;
         *  Represents whether to disable software written init key, and force use
         *  efuse_init_key.
         */
        uint32_t force_disable_sw_init_key:1;
        /** km_xts_key_length_256 : RO; bitpos: [18]; default: 0;
         *  Represents whether to configure flash encryption use xts-128 key. else use xts-256
         *  key.
         *  0: 128-bit key
         *  1: 256-bit key
         */
        uint32_t km_xts_key_length_256:1;
        /** wdt_delay_sel : RO; bitpos: [19]; default: 0;
         *  Represents the threshold level of the RTC watchdog STG0 timeout.
         *  0: Original threshold configuration value of STG0 *2
         *  1: Original threshold configuration value of STG0 *4
         *  2: Original threshold configuration value of STG0 *8
         *  3: Original threshold configuration value of STG0 *16
         */
        uint32_t wdt_delay_sel:1;
        /** dis_sm_crypt : RO; bitpos: [20]; default: 0;
         *  Represents whether to disable all the SM crypto functions, including SM2, SM3.
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_sm_crypt:1;
        /** spi_boot_crypt_cnt : RO; bitpos: [23:21]; default: 0;
         *  Represents whether SPI boot encrypt/decrypt is disabled or enabled.
         *  Odd number of 1: enabled
         *  Even number of 1: disabled
         */
        uint32_t spi_boot_crypt_cnt:3;
        /** secure_boot_key_revoke0 : RO; bitpos: [24]; default: 0;
         *  Revoke 1st secure boot key
         */
        uint32_t secure_boot_key_revoke0:1;
        /** secure_boot_key_revoke1 : RO; bitpos: [25]; default: 0;
         *  Revoke 2nd secure boot key
         */
        uint32_t secure_boot_key_revoke1:1;
        /** secure_boot_key_revoke2 : RO; bitpos: [26]; default: 0;
         *  Revoke 3rd secure boot key
         */
        uint32_t secure_boot_key_revoke2:1;
        /** reserved_0_91 : R; bitpos: [31:27]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_91:5;
    };
    uint32_t val;
} efuse_rd_repeat_data1_reg_t;

/** Type of rd_repeat_data2 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** key_purpose_0 : RO; bitpos: [4:0]; default: 0;
         *  Represents the purpose of Key0.
         */
        uint32_t key_purpose_0:5;
        /** key_purpose_1 : RO; bitpos: [9:5]; default: 0;
         *  Represents the purpose of Key1.
         */
        uint32_t key_purpose_1:5;
        /** key_purpose_2 : RO; bitpos: [14:10]; default: 0;
         *  Represents the purpose of Key2.
         */
        uint32_t key_purpose_2:5;
        /** key_purpose_3 : RO; bitpos: [19:15]; default: 0;
         *  Represents the purpose of Key3.
         */
        uint32_t key_purpose_3:5;
        /** key_purpose_4 : RO; bitpos: [24:20]; default: 0;
         *  Represents the purpose of Key4.
         */
        uint32_t key_purpose_4:5;
        /** ecc_force_const_time : RO; bitpos: [25]; default: 0;
         *  Represents whether permanently turn on ECC const-time mode.
         *  1: turn on
         *  0: turn off
         */
        uint32_t ecc_force_const_time:1;
        /** ecdsa_disable_soft_k : RO; bitpos: [26]; default: 0;
         *  Represents whether permanently turn off ECDSA software set KEY.
         *  1: turn off
         *  0: turn on
         */
        uint32_t ecdsa_disable_soft_k:1;
        /** sec_dpa_level : RO; bitpos: [28:27]; default: 0;
         *  Represents the spa secure level by configuring the clock random divide mode.
         */
        uint32_t sec_dpa_level:2;
        /** xts_dpa_clk_enable : RO; bitpos: [29]; default: 0;
         *  Represents whether to enable xts clock anti-dpa attack function.
         *  0: Disabled.
         *  1: Enabled
         */
        uint32_t xts_dpa_clk_enable:1;
        /** reserved_0_126 : R; bitpos: [31:30]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_126:2;
    };
    uint32_t val;
} efuse_rd_repeat_data2_reg_t;

