espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_struct.h
/** Type of rd_repeat_data3 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** xts_dpa_pseudo_level : RO; bitpos: [1:0]; default: 0;
         *  Represents the control of the xts pseudo-round anti-dpa attack function. 0:
         *  controlled by register. 1-3: the higher the value is; the more pseudo-rounds are
         *  inserted to the xts-aes calculation
         */
        uint32_t xts_dpa_pseudo_level:2;
        /** secure_boot_en : RO; bitpos: [2]; default: 0;
         *  Represents whether secure boot is enabled or disabled.
         *  1: enabled
         *  0: disabled
         */
        uint32_t secure_boot_en:1;
        /** secure_boot_aggressive_revoke : RO; bitpos: [3]; default: 0;
         *  Represents whether revoking aggressive secure boot is enabled or disabled.
         *  1: enabled.
         *  0: disabled
         */
        uint32_t secure_boot_aggressive_revoke:1;
        /** reserved_0_132 : R; bitpos: [4]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_132:1;
        /** flash_type : RO; bitpos: [5]; default: 0;
         *  flash type: 0: nor flash, 1: nand flash
         */
        uint32_t flash_type:1;
        /** reserved_0_134 : R; bitpos: [8:6]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_134:3;
        /** dis_usb_otg_download_mode : RO; bitpos: [9]; default: 0;
         *  Set this bit to disable download via USB-OTG.
         */
        uint32_t dis_usb_otg_download_mode:1;
        /** reserved_0_138 : R; bitpos: [11:10]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_138:2;
        /** flash_tpuw : RO; bitpos: [15:12]; default: 0;
         *  Represents the flash waiting time after power-up, in unit of ms. When the value
         *  less than 15, the waiting time is the programmed value. Otherwise, the waiting time
         *  is 2 times the programmed value.
         */
        uint32_t flash_tpuw:4;
        /** dis_download_mode : RO; bitpos: [16]; default: 0;
         *  Represents whether Download mode is disabled or enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_download_mode:1;
        /** dis_direct_boot : RO; bitpos: [17]; default: 0;
         *  Represents whether direct boot mode is disabled or enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_direct_boot:1;
        /** dis_usb_serial_jtag_rom_print : RO; bitpos: [18]; default: 0;
         *  Represents whether print from USB-Serial-JTAG is disabled or enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t dis_usb_serial_jtag_rom_print:1;
        /** lock_km_key : RO; bitpos: [19]; default: 0;
         *  Represetns whether to lock the efuse xts key.
         *  1. Lock
         *  0: Unlock
         */
        uint32_t lock_km_key:1;
        /** dis_usb_serial_jtag_download_mode : RO; bitpos: [20]; default: 0;
         *  Represents whether the USB-Serial-JTAG download function is disabled or enabled.
         *  1: Disable
         *  0: Enable
         */
        uint32_t dis_usb_serial_jtag_download_mode:1;
        /** enable_security_download : RO; bitpos: [21]; default: 0;
         *  Represents whether security download is enabled or disabled.
         *  1: enabled
         *  0: disabled
         */
        uint32_t enable_security_download:1;
        /** uart_print_control : RO; bitpos: [23:22]; default: 0;
         *  Represents the type of UART printing.
         *  00: force enable printing
         *  01: enable printing when GPIO8 is reset at low level
         *  10: enable printing when GPIO8 is reset at high level
         *  11: force disable printing
         */
        uint32_t uart_print_control:2;
        /** force_send_resume : RO; bitpos: [24]; default: 0;
         *  Represents whether ROM code is forced to send a resume command during SPI boot.
         *  1: forced
         *  0:not forced
         */
        uint32_t force_send_resume:1;
        /** reserved_0_153 : R; bitpos: [31:25]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_153:7;
    };
    uint32_t val;
} efuse_rd_repeat_data3_reg_t;

/** Type of rd_repeat_data4 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** secure_version : RO; bitpos: [15:0]; default: 0;
         *  Represents the version used by ESP-IDF anti-rollback feature.
         */
        uint32_t secure_version:16;
        /** secure_boot_disable_fast_wake : RO; bitpos: [16]; default: 0;
         *  Represents whether FAST VERIFY ON WAKE is disabled or enabled when Secure Boot is
         *  enabled.
         *  1: disabled
         *  0: enabled
         */
        uint32_t secure_boot_disable_fast_wake:1;
        /** hys_en_pad : RO; bitpos: [17]; default: 0;
         *  Represents whether the hysteresis function of corresponding PAD is enabled.
         *  1: enabled
         *  0:disabled
         */
        uint32_t hys_en_pad:1;
        /** reserved_0_178 : R; bitpos: [31:18]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_178:14;
    };
    uint32_t val;
} efuse_rd_repeat_data4_reg_t;

/** Type of rd_repeat_data5 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** reserved_0_192 : R; bitpos: [1:0]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_192:2;
        /** dcdc_vset_en : RO; bitpos: [2]; default: 0;
         *  Select dcdc vset use efuse_dcdc_vset.
         */
        uint32_t dcdc_vset_en:1;
        /** dis_wdt : RO; bitpos: [3]; default: 0;
         *  Set this bit to disable watch dog.
         */
        uint32_t dis_wdt:1;
        /** dis_swd : RO; bitpos: [4]; default: 0;
         *  Set this bit to disable super-watchdog.
         */
        uint32_t dis_swd:1;
        /** reserved_0_197 : R; bitpos: [10:5]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_197:6;
        /** secure_boot_sha384_en : RO; bitpos: [11]; default: 0;
         *  Represents whether secure boot using SHA-384 is enabled. 0: Disable 1: Enable
         */
        uint32_t secure_boot_sha384_en:1;
        /** bootloader_anti_rollback_secure_version : RO; bitpos: [15:12]; default: 0;
         *  Represents the anti-rollback secure version of the 2nd stage bootloader used by the
         *  ROM bootloader.
         */
        uint32_t bootloader_anti_rollback_secure_version:4;
        /** bootloader_anti_rollback_en : RO; bitpos: [16]; default: 0;
         *  Represents whether the ani-rollback check for the 2nd stage bootloader is enabled.
         *  1: Enabled
         *  0: Disabled
         */
        uint32_t bootloader_anti_rollback_en:1;
        /** bootloader_anti_rollback_update_in_rom : RO; bitpos: [17]; default: 0;
         *  Represents whether the ani-rollback SECURE_VERSION will be updated from the ROM
         *  bootloader.
         *  1: Enable
         *  0: Disable
         */
        uint32_t bootloader_anti_rollback_update_in_rom:1;
        /** recovery_bootloader_flash_sector : RO; bitpos: [29:18]; default: 0;
         *  Represents the starting flash sector (flash sector size is 0x1000) of the recovery
         *  bootloader used by the ROM bootloader If the primary bootloader fails. 0 and 0xFFF
         *  - this feature is disabled.
         */
        uint32_t recovery_bootloader_flash_sector:12;
        /** sdc_ena : RO; bitpos: [31:30]; default: 0;
         *  Represents whether SDC function is supported in download mode.
         *  2'b01/2'b10: enabled
         *  2'b00/2'b11: disabled
         */
        uint32_t sdc_ena:2;
    };
    uint32_t val;
} efuse_rd_repeat_data5_reg_t;

