espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_struct.h
/** Type of rd_repeat_data6 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** sdc_session_counter : RO; bitpos: [2:0]; default: 0;
         *  Represents the number of times the SDC session has been entered.
         */
        uint32_t sdc_session_counter:3;
        /** sdc_nonce_ena : RO; bitpos: [4:3]; default: 0;
         *  Represents whether random number NONCE is used in SDC and whether the KM module is
         *  used to generate the NONCE
         *  . 2'bx0: No NONCE
         *  2'b1x: Use KM generate NONCE.
         */
        uint32_t sdc_nonce_ena:2;
        /** sdc_chip_info_source : RO; bitpos: [5]; default: 0;
         *  Represents whether HUK_info is selected as the source for calculating CHIP_info in
         *  SDC.
         *  1: use HUK_info
         *  0: use UNIQ_id
         */
        uint32_t sdc_chip_info_source:1;
        /** sdc_disable_fast_vef : RO; bitpos: [6]; default: 0;
         *  Represents whether disable FAST_VEF in SDC session.
         *  1: disable
         *  0: enable
         */
        uint32_t sdc_disable_fast_vef:1;
        /** pvt_0_glitch_en : RO; bitpos: [7]; default: 0;
         *  Represents whether to enable PVT power glitch monitor function.
         *  1:Enable.
         *  0:Disable
         */
        uint32_t pvt_0_glitch_en:1;
        /** pvt_0_glitch_mode : RO; bitpos: [9:8]; default: 0;
         *  Use to configure glitch mode
         */
        uint32_t pvt_0_glitch_mode:2;
        /** pvt_1_glitch_en : RO; bitpos: [10]; default: 0;
         *  Represents whether to enable PVT power glitch monitor function.
         *  1:Enable.
         *  0:Disable
         */
        uint32_t pvt_1_glitch_en:1;
        /** pvt_1_glitch_mode : RO; bitpos: [12:11]; default: 0;
         *  Use to configure glitch mode
         */
        uint32_t pvt_1_glitch_mode:2;
        /** pmu_flash_power_sel : RO; bitpos: [13]; default: 0;
         *  FLASH power select.
         *  1'b1: use 3.3V
         *  1'b0: use 1.8V
         */
        uint32_t pmu_flash_power_sel:1;
        /** pmu_flash_power_sel_en : RO; bitpos: [14]; default: 0;
         *  FLASH power select enable signal. 1'b1 : validates EFUSE_PMU_FLASH_POWER_SEL 1'b0:
         *  invalidates EFUSE_PMU_FLASH_POWER_SEL
         */
        uint32_t pmu_flash_power_sel_en:1;
        /** power_glitch_en : RO; bitpos: [18:15]; default: 0;
         *  set these bit enable power glitch enable
         */
        uint32_t power_glitch_en:4;
        /** ena_xts_shadow : RO; bitpos: [19]; default: 0;
         *  Represents whether to enable XTS-AES shadow core countermeasure against fault
         *  injection attacks.
         *  0: Disabled
         *  1: Enabled
         */
        uint32_t ena_xts_shadow:1;
        /** ena_spi_boot_crypt_scrambler : RO; bitpos: [20]; default: 0;
         *  Represents whether to enable ciphertext scrambler for external memory .
         *  0: Disabled
         *  1: Enabled
         */
        uint32_t ena_spi_boot_crypt_scrambler:1;
        /** re_enable_jtag_source : RO; bitpos: [21]; default: 0;
         *  Represents which Crypto peripheral is selected for re-enabling JTAG.
         *  0: SDC
         *  1: HMAC
         */
        uint32_t re_enable_jtag_source:1;
        /** reserved_0_246 : R; bitpos: [31:22]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_246:10;
    };
    uint32_t val;
} efuse_rd_repeat_data6_reg_t;

/** Type of rd_repeat_data7 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** repeat7_rsvd : RO; bitpos: [15:0]; default: 0;
         *  Reserved.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t repeat7_rsvd:16;
        /** reserved_0_272 : R; bitpos: [31:16]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_0_272:16;
    };
    uint32_t val;
} efuse_rd_repeat_data7_reg_t;


/** Group: block1 registers */
/** Type of rd_mac_sys0 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_0 : RO; bitpos: [31:0]; default: 0;
         *  Represents MAC address. Low 32-bit.
         */
        uint32_t mac_0:32;
    };
    uint32_t val;
} efuse_rd_mac_sys0_reg_t;

/** Type of rd_mac_sys1 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_1 : RO; bitpos: [15:0]; default: 0;
         *  Represents MAC address. High 16-bit.
         */
        uint32_t mac_1:16;
        /** mac_ext : RO; bitpos: [31:16]; default: 0;
         *  Represents the extended bits of MAC address.
         */
        uint32_t mac_ext:16;
    };
    uint32_t val;
} efuse_rd_mac_sys1_reg_t;

/** Type of rd_mac_sys2 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_reserved_0 : RO; bitpos: [13:0]; default: 0;
         *  Reserved.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t mac_reserved_0:14;
        /** mac_reserved_1 : RO; bitpos: [31:14]; default: 0;
         *  Reserved.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t mac_reserved_1:18;
    };
    uint32_t val;
} efuse_rd_mac_sys2_reg_t;

/** Type of rd_mac_sys3 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_reserved_2 : RO; bitpos: [17:0]; default: 0;
         *  Reserved.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t mac_reserved_2:18;
        /** wafer_version_minor : R; bitpos: [21:18]; default: 0;
         *  Minor chip version
         */
        uint32_t wafer_version_minor:4;
        /** wafer_version_major : R; bitpos: [23:22]; default: 0;
         *  Major chip version
         */
        uint32_t wafer_version_major:2;
        /** disable_wafer_version_major : R; bitpos: [24]; default: 0;
         *  Disables check of wafer version major
         */
        uint32_t disable_wafer_version_major:1;
        /** disable_blk_version_major : R; bitpos: [25]; default: 0;
         *  Disables check of blk version major
         */
        uint32_t disable_blk_version_major:1;
        /** blk_version_minor : R; bitpos: [28:26]; default: 0;
         *  BLK_VERSION_MINOR of BLOCK2
         */
        uint32_t blk_version_minor:3;
        /** blk_version_major : R; bitpos: [30:29]; default: 0;
         *  BLK_VERSION_MAJOR of BLOCK2
         */
        uint32_t blk_version_major:2;
        /** psram_cap : R; bitpos: [31]; default: 0;
         *  Psram capacity
         */
        uint32_t psram_cap:1;
    };
    uint32_t val;
} efuse_rd_mac_sys3_reg_t;

/** Type of rd_mac_sys4 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** psram_cap_1 : R; bitpos: [1:0]; default: 0;
         *  Psram capacity
         */
        uint32_t psram_cap_1:2;
        /** temp : R; bitpos: [3:2]; default: 0;
         *  Maximum ambient temperature that ESP Chip can work properly
         */
        uint32_t temp:2;
        /** psram_vendor : R; bitpos: [5:4]; default: 0;
         *  Psram vendor
         */
        uint32_t psram_vendor:2;
        /** pkg_version : R; bitpos: [7:6]; default: 0;
         *  Package version
         */
        uint32_t pkg_version:2;
        /** ocode : R; bitpos: [15:8]; default: 0;
         *  OCode calibration
         */
        uint32_t ocode:8;
        /** active_hp_dbias : R; bitpos: [19:16]; default: 0;
         *  Active HP DBIAS of fixed voltage
         */
        uint32_t active_hp_dbias:4;
        /** active_lp_dbias : R; bitpos: [23:20]; default: 0;
         *  Active LP DBIAS of fixed voltage
         */
        uint32_t active_lp_dbias:4;
        /** lslp_hp_dbg : R; bitpos: [25:24]; default: 0;
         *  LSLP HP DBG of fixed voltage
         */
        uint32_t lslp_hp_dbg:2;
        /** lslp_hp_dbias : R; bitpos: [29:26]; default: 0;
         *  LSLP HP DBIAS of fixed voltage
         */
        uint32_t lslp_hp_dbias:4;
        /** dslp_lp_dbg : R; bitpos: [31:30]; default: 0;
         *  DSLP LP DBG of fixed voltage
         */
        uint32_t dslp_lp_dbg:2;
    };
    uint32_t val;
} efuse_rd_mac_sys4_reg_t;

