espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_struct.h
/** Type of rd_usr_data7 register
 *  Represents rd_usr_data7
 */
typedef union {
    struct {
        /** custom_mac_1 : R; bitpos: [23:0]; default: 0;
         *  Custom MAC
         */
        uint32_t custom_mac_1:24;
        /** reserved_3_248 : R; bitpos: [31:24]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_3_248:8;
    };
    uint32_t val;
} efuse_rd_usr_data7_reg_t;

/** Group: block4 registers */
/** Type of rd_key0_datan register
 *  Represents rd_key0_datan
 */
typedef union {
    struct {
        /** key0_datan : RO; bitpos: [31:0]; default: 0;
         *  Represents the zeroth 32-bit of key0.
         */
        uint32_t key0_datan:32;
    };
    uint32_t val;
} efuse_rd_key0_datan_reg_t;


/** Group: block5 registers */
/** Type of rd_key1_datan register
 *  Represents rd_key1_datan
 */
typedef union {
    struct {
        /** key1_datan : RO; bitpos: [31:0]; default: 0;
         *  Represents the zeroth 32-bit of key1.
         */
        uint32_t key1_datan:32;
    };
    uint32_t val;
} efuse_rd_key1_datan_reg_t;


/** Group: block6 registers */
/** Type of rd_key2_datan register
 *  Represents rd_key2_datan
 */
typedef union {
    struct {
        /** key2_datan : RO; bitpos: [31:0]; default: 0;
         *  Represents the zeroth 32-bit of key2.
         */
        uint32_t key2_datan:32;
    };
    uint32_t val;
} efuse_rd_key2_datan_reg_t;


/** Group: block7 registers */
/** Type of rd_key3_datan register
 *  Represents rd_key3_datan
 */
typedef union {
    struct {
        /** key3_datan : RO; bitpos: [31:0]; default: 0;
         *  Represents the zeroth 32-bit of key3.
         */
        uint32_t key3_datan:32;
    };
    uint32_t val;
} efuse_rd_key3_datan_reg_t;


/** Group: block8 registers */
/** Type of rd_key4_datan register
 *  Represents rd_key4_datan
 */
typedef union {
    struct {
        /** key4_datan : RO; bitpos: [31:0]; default: 0;
         *  Represents the zeroth 32-bit of key4.
         */
        uint32_t key4_datan:32;
    };
    uint32_t val;
} efuse_rd_key4_datan_reg_t;


/** Group: block9 registers */
/** Type of rd_sys_part2_data0 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** adc1_diff_k : R; bitpos: [10:0]; default: 0;
         *  Fitted slope (K) of ADC1 in differential mode
         */
        uint32_t adc1_diff_k:11;
        /** adc1_diff_b : R; bitpos: [20:11]; default: 0;
         *  Intercept (B) of ADC1 in differential mode
         */
        uint32_t adc1_diff_b:10;
        /** adc1_p_k : R; bitpos: [31:21]; default: 0;
         *  Fitted slope (K) of ADC1 in P mode
         */
        uint32_t adc1_p_k:11;
    };
    uint32_t val;
} efuse_rd_sys_part2_data0_reg_t;

/** Type of rd_sys_part2_data1 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** adc1_p_b : R; bitpos: [9:0]; default: 0;
         *  Intercept (B) of ADC1 in P mode
         */
        uint32_t adc1_p_b:10;
        /** adc1_n_k : R; bitpos: [20:10]; default: 0;
         *  Fitted slope (K) of ADC1 in N mode
         */
        uint32_t adc1_n_k:11;
        /** adc1_n_b : R; bitpos: [30:21]; default: 0;
         *  Intercept (B) of ADC1 in N mode
         */
        uint32_t adc1_n_b:10;
        /** adc2_diff_k : R; bitpos: [31]; default: 0;
         *  Fitted slope (K) of ADC2 in differential mode
         */
        uint32_t adc2_diff_k:1;
    };
    uint32_t val;
} efuse_rd_sys_part2_data1_reg_t;

/** Type of rd_sys_part2_data2 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** adc2_diff_k_1 : R; bitpos: [9:0]; default: 0;
         *  Fitted slope (K) of ADC2 in differential mode
         */
        uint32_t adc2_diff_k_1:10;
        /** adc2_diff_b : R; bitpos: [19:10]; default: 0;
         *  Intercept (B) of ADC2 in differential mode
         */
        uint32_t adc2_diff_b:10;
        /** adc2_p_k : R; bitpos: [30:20]; default: 0;
         *  Fitted slope (K) of ADC2 in P mode
         */
        uint32_t adc2_p_k:11;
        /** adc2_p_b : R; bitpos: [31]; default: 0;
         *  Intercept (B) of ADC2 in P mode
         */
        uint32_t adc2_p_b:1;
    };
    uint32_t val;
} efuse_rd_sys_part2_data2_reg_t;

/** Type of rd_sys_part2_data3 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** adc2_p_b_1 : R; bitpos: [8:0]; default: 0;
         *  Intercept (B) of ADC2 in P mode
         */
        uint32_t adc2_p_b_1:9;
        /** adc2_n_k : R; bitpos: [19:9]; default: 0;
         *  Fitted slope (K) of ADC2 in N mode
         */
        uint32_t adc2_n_k:11;
        /** adc2_n_b : R; bitpos: [29:20]; default: 0;
         *  Intercept (B) of ADC2 in N mode
         */
        uint32_t adc2_n_b:10;
        /** reserved_9_126 : R; bitpos: [31:30]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_9_126:2;
    };
    uint32_t val;
} efuse_rd_sys_part2_data3_reg_t;

/** Type of rd_sys_part2_data4 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** sys_data_part2_4 : RO; bitpos: [31:0]; default: 0;
         *  Represents the fourth 32-bit of second part of system data.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t sys_data_part2_4:32;
    };
    uint32_t val;
} efuse_rd_sys_part2_data4_reg_t;

/** Type of rd_sys_part2_data5 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** sys_data_part2_5 : RO; bitpos: [31:0]; default: 0;
         *  Represents the fifth 32-bit of second part of system data.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t sys_data_part2_5:32;
    };
    uint32_t val;
} efuse_rd_sys_part2_data5_reg_t;

/** Type of rd_sys_part2_data6 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** usb_device_exchg_pins : RO; bitpos: [0]; default: 0;
         *  Represents whether enable usb device exchange pins of D+ and D- or not.
         *  1: enabled
         *  0: disabled
         */
        uint32_t usb_device_exchg_pins:1;
        /** usb_device_drefh : RO; bitpos: [2:1]; default: 0;
         *  Represents the single-end input threshold vrefh, 1.76 V to 2 V with step of 80 mV.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t usb_device_drefh:2;
        /** usb_device_drefl : RO; bitpos: [4:3]; default: 0;
         *  Represents the usb device single-end input low threshold, 0.8 V to 1.04 V with step
         *  of 80 mV.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t usb_device_drefl:2;
        /** reserved_9_197 : R; bitpos: [16:5]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_9_197:12;
        /** pvt_0_cell_select : RO; bitpos: [23:17]; default: 0;
         *  Power glitch monitor PVT cell select.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t pvt_0_cell_select:7;
        /** pvt_1_cell_select : RO; bitpos: [30:24]; default: 0;
         *  Power glitch monitor PVT cell select.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t pvt_1_cell_select:7;
        /** reserved_9_223 : R; bitpos: [31]; default: 0;
         *  reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t reserved_9_223:1;
    };
    uint32_t val;
} efuse_rd_sys_part2_data6_reg_t;

/** Type of rd_sys_part2_data7 register
 *  Represents rd_sys_part2_data
 */
typedef union {
    struct {
        /** pvt_0_limit : RO; bitpos: [15:0]; default: 0;
         *  Power glitch monitor threthold.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t pvt_0_limit:16;
        /** pvt_1_limit : RO; bitpos: [31:16]; default: 0;
         *  Power glitch monitor threthold.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t pvt_1_limit:16;
    };
    uint32_t val;
} efuse_rd_sys_part2_data7_reg_t;


