espressif/esp-idf/components/soc/esp32s31/register/soc/efuse_struct.h
/** Type of rd_repeat_data_err3 register
 *  Represents rd_repeat_data_err
 */
typedef union {
    struct {
        /** xts_dpa_pseudo_level_err : RO; bitpos: [1:0]; default: 0;
         *  Represents the programming error of EFUSE_XTS_DPA_PSEUDO_LEVEL
         */
        uint32_t xts_dpa_pseudo_level_err:2;
        /** secure_boot_en_err : RO; bitpos: [2]; default: 0;
         *  Represents the programming error of EFUSE_SECURE_BOOT_EN
         */
        uint32_t secure_boot_en_err:1;
        /** secure_boot_aggressive_revoke_err : RO; bitpos: [3]; default: 0;
         *  Represents the programming error of EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE
         */
        uint32_t secure_boot_aggressive_revoke_err:1;
        uint32_t reserved_4:1;
        /** flash_type_err : RO; bitpos: [5]; default: 0;
         *  Represents the programming error of EFUSE_FLASH_TYPE
         */
        uint32_t flash_type_err:1;
        uint32_t reserved_6:3;
        /** dis_usb_otg_download_mode_err : RO; bitpos: [9]; default: 0;
         *  Represents the programming error of EFUSE_DIS_USB_OTG_DOWNLOAD_MODE
         */
        uint32_t dis_usb_otg_download_mode_err:1;
        uint32_t reserved_10:2;
        /** flash_tpuw_err : RO; bitpos: [15:12]; default: 0;
         *  Represents the programming error of EFUSE_FLASH_TPUW
         */
        uint32_t flash_tpuw_err:4;
        /** dis_download_mode_err : RO; bitpos: [16]; default: 0;
         *  Represents the programming error of EFUSE_DIS_DOWNLOAD_MODE
         */
        uint32_t dis_download_mode_err:1;
        /** dis_direct_boot_err : RO; bitpos: [17]; default: 0;
         *  Represents the programming error of EFUSE_DIS_DIRECT_BOOT
         */
        uint32_t dis_direct_boot_err:1;
        /** dis_usb_serial_jtag_rom_print_err : RO; bitpos: [18]; default: 0;
         *  Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT
         */
        uint32_t dis_usb_serial_jtag_rom_print_err:1;
        /** lock_km_key_err : RO; bitpos: [19]; default: 0;
         *  Represents the programming error of EFUSE_LOCK_KM_KEY
         */
        uint32_t lock_km_key_err:1;
        /** dis_usb_serial_jtag_download_mode_err : RO; bitpos: [20]; default: 0;
         *  Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE
         */
        uint32_t dis_usb_serial_jtag_download_mode_err:1;
        /** enable_security_download_err : RO; bitpos: [21]; default: 0;
         *  Represents the programming error of EFUSE_ENABLE_SECURITY_DOWNLOAD
         */
        uint32_t enable_security_download_err:1;
        /** uart_print_control_err : RO; bitpos: [23:22]; default: 0;
         *  Represents the programming error of EFUSE_UART_PRINT_CONTROL
         */
        uint32_t uart_print_control_err:2;
        /** force_send_resume_err : RO; bitpos: [24]; default: 0;
         *  Represents the programming error of EFUSE_FORCE_SEND_RESUME
         */
        uint32_t force_send_resume_err:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} efuse_rd_repeat_data_err3_reg_t;

/** Type of rd_repeat_data_err4 register
 *  Represents rd_repeat_data_err
 */
typedef union {
    struct {
        /** secure_version_err : RO; bitpos: [15:0]; default: 0;
         *  Represents the programming error of EFUSE_SECURE_VERSION
         */
        uint32_t secure_version_err:16;
        /** secure_boot_disable_fast_wake_err : RO; bitpos: [16]; default: 0;
         *  Represents the programming error of EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE
         */
        uint32_t secure_boot_disable_fast_wake_err:1;
        /** hys_en_pad_err : RO; bitpos: [17]; default: 0;
         *  Represents the programming error of EFUSE_HYS_EN_PAD
         */
        uint32_t hys_en_pad_err:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} efuse_rd_repeat_data_err4_reg_t;

/** Type of rd_repeat_data_err5 register
 *  Represents rd_repeat_data_err
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** dcdc_vset_en_err : RO; bitpos: [2]; default: 0;
         *  Represents the programming error of EFUSE_DCDC_VSET_EN
         */
        uint32_t dcdc_vset_en_err:1;
        /** dis_wdt_err : RO; bitpos: [3]; default: 0;
         *  Represents the programming error of EFUSE_DIS_WDT
         */
        uint32_t dis_wdt_err:1;
        /** dis_swd_err : RO; bitpos: [4]; default: 0;
         *  Represents the programming error of EFUSE_DIS_SWD
         */
        uint32_t dis_swd_err:1;
        uint32_t reserved_5:6;
        /** secure_boot_sha384_en_err : RO; bitpos: [11]; default: 0;
         *  Represents the programming error of EFUSE_SECURE_BOOT_SHA384_EN
         */
        uint32_t secure_boot_sha384_en_err:1;
        /** bootloader_anti_rollback_secure_version_err : RO; bitpos: [15:12]; default: 0;
         *  Represents the programming error of EFUSE_BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION
         */
        uint32_t bootloader_anti_rollback_secure_version_err:4;
        /** bootloader_anti_rollback_en_err : RO; bitpos: [16]; default: 0;
         *  Represents the programming error of EFUSE_BOOTLOADER_ANTI_ROLLBACK_EN
         */
        uint32_t bootloader_anti_rollback_en_err:1;
        /** bootloader_anti_rollback_update_in_rom_err : RO; bitpos: [17]; default: 0;
         *  Represents the programming error of EFUSE_BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM
         */
        uint32_t bootloader_anti_rollback_update_in_rom_err:1;
        /** recovery_bootloader_flash_sector_err : RO; bitpos: [29:18]; default: 0;
         *  Represents the programming error of EFUSE_RECOVERY_BOOTLOADER_FLASH_SECTOR
         */
        uint32_t recovery_bootloader_flash_sector_err:12;
        /** rma_ena_err : RO; bitpos: [31:30]; default: 0;
         *  Represents the programming error of EFUSE_RMA_ENA
         */
        uint32_t rma_ena_err:2;
    };
    uint32_t val;
} efuse_rd_repeat_data_err5_reg_t;

/** Type of rd_repeat_data_err6 register
 *  Represents rd_repeat_data_err
 */
typedef union {
    struct {
        /** rma_session_counter_err : RO; bitpos: [2:0]; default: 0;
         *  Represents the programming error of EFUSE_RMA_SESSION_COUNTER
         */
        uint32_t rma_session_counter_err:3;
        /** rma_nonce_ena_err : RO; bitpos: [4:3]; default: 0;
         *  Represents the programming error of EFUSE_RMA_NONCE_ENA
         */
        uint32_t rma_nonce_ena_err:2;
        /** rma_chip_info_source_err : RO; bitpos: [5]; default: 0;
         *  Represents the programming error of EFUSE_RMA_CHIP_INFO_SOURCE
         */
        uint32_t rma_chip_info_source_err:1;
        /** rma_disable_fast_vef_err : RO; bitpos: [6]; default: 0;
         *  Represents the programming error of EFUSE_RMA_DISABLE_FAST_VEF
         */
        uint32_t rma_disable_fast_vef_err:1;
        /** pvt_0_glitch_en_err : RO; bitpos: [7]; default: 0;
         *  Represents the programming error of EFUSE_PVT_0_GLITCH_EN
         */
        uint32_t pvt_0_glitch_en_err:1;
        /** pvt_0_glitch_mode_err : RO; bitpos: [9:8]; default: 0;
         *  Represents the programming error of EFUSE_PVT_0_GLITCH_MODE
         */
        uint32_t pvt_0_glitch_mode_err:2;
        /** pvt_1_glitch_en_err : RO; bitpos: [10]; default: 0;
         *  Represents the programming error of EFUSE_PVT_1_GLITCH_EN
         */
        uint32_t pvt_1_glitch_en_err:1;
        /** pvt_1_glitch_mode_err : RO; bitpos: [12:11]; default: 0;
         *  Represents the programming error of EFUSE_PVT_1_GLITCH_MODE
         */
        uint32_t pvt_1_glitch_mode_err:2;
        /** pmu_flash_power_sel_err : RO; bitpos: [13]; default: 0;
         *  Represents the programming error of EFUSE_PMU_FLASH_POWER_SEL
         */
        uint32_t pmu_flash_power_sel_err:1;
        /** pmu_flash_power_sel_en_err : RO; bitpos: [14]; default: 0;
         *  Represents the programming error of EFUSE_PMU_FLASH_POWER_SEL_EN
         */
        uint32_t pmu_flash_power_sel_en_err:1;
        /** power_glitch_en_err : RO; bitpos: [18:15]; default: 0;
         *  Represents the programming error of EFUSE_POWER_GLITCH_EN
         */
        uint32_t power_glitch_en_err:4;
        /** ena_xts_shadow_err : RO; bitpos: [19]; default: 0;
         *  Represents the programming error of EFUSE_ENA_XTS_SHADOW
         */
        uint32_t ena_xts_shadow_err:1;
        /** ena_spi_boot_crypt_scrambler_err : RO; bitpos: [20]; default: 0;
         *  Represents the programming error of EFUSE_ENA_SPI_BOOT_CRYPT_SCRAMBLER
         */
        uint32_t ena_spi_boot_crypt_scrambler_err:1;
        /** re_enable_jtag_source_err : RO; bitpos: [21]; default: 0;
         *  Represents the programming error of EFUSE_RE_ENABLE_JTAG_SOURCE
         */
        uint32_t re_enable_jtag_source_err:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} efuse_rd_repeat_data_err6_reg_t;

/** Type of rd_repeat_data_err7 register
 *  Represents rd_repeat_data_err
 */
typedef union {
    struct {
        /** repeat7_rsvd_err : RO; bitpos: [15:0]; default: 0;
         *  Represents the programming error of EFUSE_REPEAT7_RSVD
         */
        uint32_t repeat7_rsvd_err:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} efuse_rd_repeat_data_err7_reg_t;


/** Group: RS block error report registers */
/** Type of rd_rs_data_err0 register
 *  Represents rd_rs_data_err
 */
typedef union {
    struct {
        /** rd_mac_sys_err_num : RO; bitpos: [2:0]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_mac_sys
         */
        uint32_t rd_mac_sys_err_num:3;
        /** rd_mac_sys_fail : RO; bitpos: [3]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_mac_sys is reliable
         *  1: Means that programming rd_mac_sys failed and the number of error bytes is over 6.
         */
        uint32_t rd_mac_sys_fail:1;
        /** rd_sys_part1_data_err_num : RO; bitpos: [6:4]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_sys_part1_data
         */
        uint32_t rd_sys_part1_data_err_num:3;
        /** rd_sys_part1_data_fail : RO; bitpos: [7]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_sys_part1_data is reliable
         *  1: Means that programming rd_sys_part1_data failed and the number of error bytes is
         *  over 6.
         */
        uint32_t rd_sys_part1_data_fail:1;
        /** rd_usr_data_err_num : RO; bitpos: [10:8]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_usr_data
         */
        uint32_t rd_usr_data_err_num:3;
        /** rd_usr_data_fail : RO; bitpos: [11]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_usr_data is reliable
         *  1: Means that programming rd_usr_data failed and the number of error bytes is over
         *  6.
         */
        uint32_t rd_usr_data_fail:1;
        /** rd_key0_data_err_num : RO; bitpos: [14:12]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_key0_data
         */
        uint32_t rd_key0_data_err_num:3;
        /** rd_key0_data_fail : RO; bitpos: [15]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_key0_data is reliable
         *  1: Means that programming rd_key0_data failed and the number of error bytes is over
         *  6.
         */
        uint32_t rd_key0_data_fail:1;
        /** rd_key1_data_err_num : RO; bitpos: [18:16]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_key1_data
         */
        uint32_t rd_key1_data_err_num:3;
        /** rd_key1_data_fail : RO; bitpos: [19]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_key1_data is reliable
         *  1: Means that programming rd_key1_data failed and the number of error bytes is over
         *  6.
         */
        uint32_t rd_key1_data_fail:1;
        /** rd_key2_data_err_num : RO; bitpos: [22:20]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_key2_data
         */
        uint32_t rd_key2_data_err_num:3;
        /** rd_key2_data_fail : RO; bitpos: [23]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_key2_data is reliable
         *  1: Means that programming rd_key2_data failed and the number of error bytes is over
         *  6.
         */
        uint32_t rd_key2_data_fail:1;
        /** rd_key3_data_err_num : RO; bitpos: [26:24]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_key3_data
         */
        uint32_t rd_key3_data_err_num:3;
        /** rd_key3_data_fail : RO; bitpos: [27]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_key3_data is reliable
         *  1: Means that programming rd_key3_data failed and the number of error bytes is over
         *  6.
         */
        uint32_t rd_key3_data_fail:1;
        /** rd_key4_data_err_num : RO; bitpos: [30:28]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_key4_data
         */
        uint32_t rd_key4_data_err_num:3;
        /** rd_key4_data_fail : RO; bitpos: [31]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_key4_data is reliable
         *  1: Means that programming rd_key4_data failed and the number of error bytes is over
         *  6.
         */
        uint32_t rd_key4_data_fail:1;
    };
    uint32_t val;
} efuse_rd_rs_data_err0_reg_t;

/** Type of rd_rs_data_err1 register
 *  Represents rd_rs_data_err
 */
typedef union {
    struct {
        /** rd_sys_part2_data_err_num : RO; bitpos: [2:0]; default: 0;
         *  Represents the error number of registers.
         *  The value of this signal means the number of error bytes in rd_sys_part2_data
         */
        uint32_t rd_sys_part2_data_err_num:3;
        /** rd_sys_part2_data_fail : RO; bitpos: [3]; default: 0;
         *  Represents error status of register.
         *  0: Means no failure and that the data of rd_sys_part2_data is reliable
         *  1: Means that programming rd_sys_part2_data failed and the number of error bytes is
         *  over 6.
         */
        uint32_t rd_sys_part2_data_fail:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} efuse_rd_rs_data_err1_reg_t;


